**** Generate migrations
#+BEGIN_SRC bash :exports code
mix ecto.gen.migration add_XXX
mix ecto.gen.migration create_XXX
#+END_SRC

The migrations files are generated into
  #+BEGIN_SRC bash :exports both :results output
  priv/repo/migrations
  #+END_SRC

  #+RESULTS:
  : priv/repo/migrations
  : ├── 20171002132113_add_topics.exs
  : ├── 20171002183207_add_users.exs
  : ├── 20171002195213_add_user_id_to_topics.exs
  : └── 20171002210038_add_comments.exs
  :
  : 0 directories, 4 files

**** phx.routes
   #+BEGIN_SRC bash :exports both :results output
   mix phx.routes
   #+END_SRC

   #+RESULTS:
   #+begin_example
   topic_path  GET     /                         Discuss.TopicController :index
   topic_path  GET     /:id/edit                 Discuss.TopicController :edit
   topic_path  GET     /new                      Discuss.TopicController :new
   topic_path  GET     /:id                      Discuss.TopicController :show
   topic_path  POST    /                         Discuss.TopicController :create
   topic_path  PATCH   /:id                      Discuss.TopicController :update
               PUT     /:id                      Discuss.TopicController :update
   topic_path  DELETE  /:id                      Discuss.TopicController :delete
    auth_path  GET     /auth/signout             Discuss.AuthController :signout
    auth_path  GET     /auth/:provider           Discuss.AuthController :request
    auth_path  GET     /auth/:provider/callback  Discuss.AuthController :callback

   #+end_example

